Revit 2027 API
ImageExportOptions.ViewName Property
 The name of the view to be created.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public string ViewName { get; set; }
Public Property ViewName As String
	Get
	Set
public:
property String^ ViewName {
	String^ get ();
	void set (String^ value);
}
member ViewName : string with get, set
Property Value
String
Exceptions
Exception | Condition
ArgumentNullException |  When setting this property: A non-optional argument was null
Remarks
 This field is used only to save an image to a project as a new view.
See Also
Reference
ImageExportOptions Class
Autodesk.Revit.DB Namespace